In [7]:
#Import all relevant libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import zscore
 
## This statement allows the visuals to render within your Jupyter Notebook.
%matplotlib inline

## Loading the data
We can now load the dataset into pandas using the read_excel() function. This converts the XLSX file into a Pandas dataframe.

In [76]:
#Read in the xlsx files and convert to a Pandas dataframe
Uni_df = {"THE": pd.read_excel('Data/Times_Higher_Education.xlsx'),
        "ARWU": pd.read_excel('Data/shanghai_Ranking.xlsx'),
        "CWUR": pd.read_excel('Data/Word_Rank_University.xlsx'),}

### Viewing the dataframe
We can get a quick sense of the size of our dataset by using the shape method. This returns a tuple with the number of rows and columns in the dataset.

In [77]:
display("Times Higher Education", Uni_df['THE'].head())
display("shanghai Ranking", Uni_df['ARWU'].head())
display("Word Rank University", Uni_df['CWUR'].head())

'Times Higher Education'

,Rank,University Name,ranking-institution-title href,Location,sdg-score-multi__number,sdg-score-multi__value,sdg-score-multi__number 2,sdg-score-multi__value 2,sdg-score-multi__number 3,sdg-score-multi__value 3,sdg-score-multi__value 4,scores,sdg-score-multi__number 5,sdg-score-multi__value 5,sdg-score-multi__number 6,sdg-score-multi__value 6,sdg-score-multi__number 7,sdg-score-multi__value 7,sdg-score-multi__number 8,sdg-score-multi__value 8
0,1,Western Sydney University,https://www.timeshighereducation.com/world-uni...,Australia,5.0,80.3,12.0,93.4,15.0,96.7,98.8,99.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,University of Manchester,https://www.timeshighereducation.com/world-uni...,United Kingdom,15.0,97.4,12.0,92.9,11.0,92.2,94.8,97.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Queen’s University,https://www.timeshighereducation.com/world-uni...,Canada,2.0,90.6,16.0,93.4,11.0,91.0,92.6,97.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Universiti Sains Malaysia,https://www.timeshighereducation.com/world-uni...,Malaysia,16.0,94.1,2.0,86.4,1.0,84.9,97.8,96.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,University of Tasmania,https://www.timeshighereducation.com/world-uni...,Australia,13.0,92.8,15.0,96.2,14.0,95.1,96.3,96.6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

'shanghai Ranking'

,Ranking,University Name,National/Regional Rank,Total Score,LOGO,University Detail
0,1,Harvard University,1,100.0,http://www.shanghairanking.com/_uni/logo/032bd...,http://www.shanghairanking.com/institution/har...
1,2,Stanford University,2,76.8,http://www.shanghairanking.com/_uni/logo/13de8...,http://www.shanghairanking.com/institution/sta...
2,3,Massachusetts Institute of Technology (MIT),3,70.1,http://www.shanghairanking.com/_uni/logo/79165...,http://www.shanghairanking.com/institution/mas...
3,4,University of Cambridge,1,69.6,http://www.shanghairanking.com/_uni/logo/8d986...,http://www.shanghairanking.com/institution/uni...
4,5,"University of California, Berkeley",4,65.3,http://www.shanghairanking.com/_uni/logo/0ff17...,http://www.shanghairanking.com/institution/uni...

'Word Rank University'

,World Rank,University Names,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Score
0,1Top 0.1%,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0
1,2Top 0.1%,Massachusetts Institute of Technology\n Educa...,USA,2,4,12,3,9,96.7
2,3Top 0.1%,Stanford University\n Education: A+; Employab...,USA,3,11,4,2,2,95.2
3,4Top 0.1%,University of Cambridge\n Education: A+; Empl...,United Kingdom,1,3,25,5,11,94.1
4,5Top 0.1%,University of Oxford\n Education: A+; Employa...,United Kingdom,2,7,27,9,4,93.3

## 1. Data Profiling:
Data profiling is a comprehensive process of examining the data available in an existing dataset and collecting statistics and information about that data.

### What we learned (so far):
.We have three data sources each one of them rank the Universities based on different criteria.<br>
.In the Times Higher Education dataset we don't know which score is for which.<br>
.We have alot of null values in the Times Higher Education dataset.<br>
.We have type missmatch where we have scores as objects where they should be integers or floats across all the 3 datasets.<br>
.There are uneeded columns that we can drop.

In [78]:
display("THE", Uni_df['THE'].info())
display("ARWU", Uni_df['ARWU'].info())
display("CWUR", Uni_df['CWUR'].info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1591 entries, 0 to 1590
Data columns (total 20 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Rank                            1591 non-null   object
 1   University Name                 1591 non-null   object
 2   ranking-institution-title href  1500 non-null   object
 3   Location                        1500 non-null   object
 4   sdg-score-multi__number         867 non-null    float64
 5   sdg-score-multi__value          867 non-null    object
 6   sdg-score-multi__number 2       826 non-null    float64
 7   sdg-score-multi__value 2        825 non-null    object
 8   sdg-score-multi__number 3       812 non-null    float64
 9   sdg-score-multi__value 3        805 non-null    object
 10  sdg-score-multi__value 4        1583 non-null   object
 11  scores                          1591 non-null   object
 12  sdg-score-multi__number 5       565 non-null    float64
 13  sdg-score-multi__value 5        557 non-null    object
 14  sdg-score-multi__number 6       498 non-null    float64
 15  sdg-score-multi__value 6        496 non-null    object
 16  sdg-score-multi__number 7       439 non-null    float64
 17  sdg-score-multi__value 7        439 non-null    object
 18  sdg-score-multi__number 8       483 non-null    float64
 19  sdg-score-multi__value 8        483 non-null    object
dtypes: float64(7), object(13)
memory usage: 248.7+ KB

'THE'

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Ranking                 1000 non-null   object
 1   University Name         1000 non-null   object
 2   National/Regional Rank  1000 non-null   object
 3   Total Score             1000 non-null   float64
 4   LOGO                    1000 non-null   object
 5   University Detail       1000 non-null   object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

'ARWU'

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   World Rank          2000 non-null   object
 1   University Names    2000 non-null   object
 2   Location            2000 non-null   object
 3   National Rank       2000 non-null   int64
 4   Educational Rank    2000 non-null   object
 5   Employability Rank  2000 non-null   object
 6   Faculty Rank        2000 non-null   object
 7   Research Rank       2000 non-null   object
 8   Score               2000 non-null   float64
dtypes: float64(1), int64(1), object(7)
memory usage: 140.8+ KB

'CWUR'

None

In [79]:
display("THE", Uni_df['THE'].shape)
display("ARWU", Uni_df['ARWU'].shape)
display("CWUR", Uni_df['CWUR'].shape)

'THE'

(1591, 20)

'ARWU'

(1000, 6)

'CWUR'

(2000, 9)

In [80]:
display("THE", Uni_df['THE'].describe())
display("ARWU", Uni_df['ARWU'].describe())
display("CWUR", Uni_df['CWUR'].describe())

'THE'

,sdg-score-multi__number,sdg-score-multi__number 2,sdg-score-multi__number 3,sdg-score-multi__number 5,sdg-score-multi__number 6,sdg-score-multi__number 7,sdg-score-multi__number 8
count,867.000000,826.000000,812.000000,565.000000,498.000000,439.000000,483.000000
mean,8.193772,8.446731,7.902709,5.488496,6.777108,7.596811,5.962733
std,4.240660,4.786111,4.403411,3.151375,3.230968,4.278980,3.346928
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,3.000000
25%,4.000000,4.000000,5.000000,3.000000,4.000000,4.000000,4.000000
50%,9.000000,8.000000,8.000000,5.000000,6.000000,7.000000,4.000000
75%,11.000000,12.000000,11.000000,8.000000,8.000000,10.000000,7.000000
max,16.000000,16.000000,16.000000,16.000000,16.000000,16.000000,16.000000

'ARWU'

       Total Score
count  1000.000000
mean      5.943500
std      12.379624
min       0.000000
25%       0.000000
50%       0.000000
75%       7.500000
max     100.000000

'CWUR'

       National Rank       Score
count    2000.000000  2000.00000
mean       69.245000    71.75555
std        85.538608     5.03880
min         1.000000    66.00000
25%         9.750000    67.90000
50%        33.000000    70.40000
75%        89.000000    74.30000
max       332.000000   100.00000

In [81]:
display("THE", Uni_df['THE'].columns)
display("ARWU", Uni_df['ARWU'].columns)
display("CWUR", Uni_df['CWUR'].columns)

'THE'

Index(['Rank', 'University Name ', 'ranking-institution-title href',
       'Location', 'sdg-score-multi__number', 'sdg-score-multi__value',
       'sdg-score-multi__number 2', 'sdg-score-multi__value 2',
       'sdg-score-multi__number 3', 'sdg-score-multi__value 3',
       'sdg-score-multi__value 4', 'scores', 'sdg-score-multi__number 5',
       'sdg-score-multi__value 5', 'sdg-score-multi__number 6',
       'sdg-score-multi__value 6', 'sdg-score-multi__number 7',
       'sdg-score-multi__value 7', 'sdg-score-multi__number 8',
       'sdg-score-multi__value 8'],
      dtype='object')

'ARWU'

Index(['Ranking', 'University Name', 'National/Regional Rank', 'Total Score',
       'LOGO', 'University Detail '],
      dtype='object')

'CWUR'

Index(['World Rank', 'University Names', 'Location ', 'National Rank',
       'Educational Rank', 'Employability Rank', 'Faculty Rank',
       'Research Rank', 'Score'],
      dtype='object')

### Data Quality Checks
Data quality checks involve the process of ensuring that the data is accurate, complete, consistent, relevant, and reliable. 


**Here are typical steps involved in checking data quality:**

#### 1. Reliability:
Evaluate the data's source and collection process to determine its trustworthiness.

##### 1.Times Higher Education(THE):
built on 10 million datapoints from over 7,000 institutions in 171 countries; on unrivalled news, insight and intelligence; and on a relationship of trust with universities spanning 50 years.


##### 2.Academic Ranking of World Universities(ARWU):
The Academic Ranking of World Universities (ARWU) was first published in June 2003 by the Center for World-Class Universities (CWCU). ARWU uses six objective indicators to rank world universities, including the number of alumni and staff winning Nobel Prizes and Fields Medals, number of highly cited researchers selected by Clarivate, number of articles published in journals of Nature and Science, number of articles indexed in Science Citation Index - Expanded and Social Sciences Citation Index, and per capita performance of a university.


##### 3.Center for World University Rankings (CWUR):
is a leading consulting organization providing policy advice, strategic insights, and consulting services to governments and universities to improve educational and research outcomes.
<br>
Since 2012, CWUR has been publishing the only academic ranking of global universities that assesses the quality of education, employability, quality of faculty, and research without relying on surveys and university data submissions.

In [82]:
#Each ranking system has its biases and methodologies, leading to different results. THE and ARWU's focus on research may undervalue other aspects like teaching quality.
#Commercial interests in THE rankings could affect its objectivity. However, these rankings also provide valuable insights into university performance.

#### 2. Timeliness: 
Ensure the data is up-to-date and reflective of the current situation or the period of interest for the analysis.

#### 3. Consistency: 

Confirm that the data is consistent within the dataset and across multiple data sources. For example, the same data point should not have different values in different places.

Each dataset focuses on ranking universities based on different criterias.

In [83]:
Uni_df['THE'].columns

Index(['Rank', 'University Name ', 'ranking-institution-title href',
       'Location', 'sdg-score-multi__number', 'sdg-score-multi__value',
       'sdg-score-multi__number 2', 'sdg-score-multi__value 2',
       'sdg-score-multi__number 3', 'sdg-score-multi__value 3',
       'sdg-score-multi__value 4', 'scores', 'sdg-score-multi__number 5',
       'sdg-score-multi__value 5', 'sdg-score-multi__number 6',
       'sdg-score-multi__value 6', 'sdg-score-multi__number 7',
       'sdg-score-multi__value 7', 'sdg-score-multi__number 8',
       'sdg-score-multi__value 8'],
      dtype='object')

In [84]:
Uni_df['THE'].rename(columns={'University Name ': 'University Name', 'scores': 'Total Score'}, inplace=True)

#### 4. Relevance:

In [85]:
Uni_df['THE'].head(1)

,Rank,University Name,ranking-institution-title href,Location,sdg-score-multi__number,sdg-score-multi__value,sdg-score-multi__number 2,sdg-score-multi__value 2,sdg-score-multi__number 3,sdg-score-multi__value 3,sdg-score-multi__value 4,Total Score,sdg-score-multi__number 5,sdg-score-multi__value 5,sdg-score-multi__number 6,sdg-score-multi__value 6,sdg-score-multi__number 7,sdg-score-multi__value 7,sdg-score-multi__number 8,sdg-score-multi__value 8
0,1,Western Sydney University,https://www.timeshighereducation.com/world-uni...,Australia,5.0,80.3,12.0,93.4,15.0,96.7,98.8,99.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [86]:
Uni_df['THE'].drop(['ranking-institution-title href'], axis=1, inplace=True)

In [87]:
Uni_df['THE'].head(1)

,Rank,University Name,Location,sdg-score-multi__number,sdg-score-multi__value,sdg-score-multi__number 2,sdg-score-multi__value 2,sdg-score-multi__number 3,sdg-score-multi__value 3,sdg-score-multi__value 4,Total Score,sdg-score-multi__number 5,sdg-score-multi__value 5,sdg-score-multi__number 6,sdg-score-multi__value 6,sdg-score-multi__number 7,sdg-score-multi__value 7,sdg-score-multi__number 8,sdg-score-multi__value 8
0,1,Western Sydney University,Australia,5.0,80.3,12.0,93.4,15.0,96.7,98.8,99.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [88]:
Uni_df['ARWU'].columns

Index(['Ranking', 'University Name', 'National/Regional Rank', 'Total Score',
       'LOGO', 'University Detail '],
      dtype='object')

In [89]:
Uni_df['ARWU'].rename(columns={'Ranking': 'Rank', 'National/Regional Rank': 'National Rank'}, inplace=True)

In [90]:
Uni_df['ARWU'].head(1)

,Rank,University Name,National Rank,Total Score,LOGO,University Detail
0,1,Harvard University,1,100.0,http://www.shanghairanking.com/_uni/logo/032bd...,http://www.shanghairanking.com/institution/har...

In [91]:
Uni_df['ARWU'].drop(['LOGO', 'University Detail '], axis=1, inplace=True)

In [92]:
Uni_df['CWUR'].columns

Index(['World Rank', 'University Names', 'Location ', 'National Rank',
       'Educational Rank', 'Employability Rank', 'Faculty Rank',
       'Research Rank', 'Score'],
      dtype='object')

In [93]:
Uni_df['CWUR'].rename(columns={"World Rank": "Rank", 'University Names': 'University Name', 'Location ': 'Location', 'Score': 'Total Score'}, inplace=True)

In [94]:
Uni_df['CWUR'].head(1)

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score
0,1Top 0.1%,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0

#### 5. Uniqueness:

In [95]:
display("THE", Uni_df['THE'].duplicated().sum())
display("ARWU", Uni_df['ARWU'].duplicated().sum())
display("CWUR", Uni_df['CWUR'].duplicated().sum() )

'THE'

0

'ARWU'

0

'CWUR'

0

#### 6. Completeness:

In [96]:
print(Uni_df['THE'].isnull().sum().sort_values(ascending = False))
print("================================")
print(Uni_df['ARWU'].isnull().sum().sort_values(ascending = False))
print("================================")
print(Uni_df['CWUR'].isnull().sum().sort_values(ascending = False))

sdg-score-multi__number 7    1152
sdg-score-multi__value 7     1152
sdg-score-multi__value 8     1108
sdg-score-multi__number 8    1108
sdg-score-multi__value 6     1095
sdg-score-multi__number 6    1093
sdg-score-multi__value 5     1034
sdg-score-multi__number 5    1026
sdg-score-multi__value 3      786
sdg-score-multi__number 3     779
sdg-score-multi__value 2      766
sdg-score-multi__number 2     765
sdg-score-multi__number       724
sdg-score-multi__value        724
Location                       91
sdg-score-multi__value 4        8
Total Score                     0
University Name                 0
Rank                            0
dtype: int64
================================
Rank               0
University Name    0
National Rank      0
Total Score        0
dtype: int64
================================
Rank                  0
University Name       0
Location              0
National Rank         0
Educational Rank      0
Employability Rank    0
Faculty Rank          0
Research Rank         0
Total Score           0
dtype: int64

#### 7. Check Accuracy:

## 2. Data Cleaning:

In [97]:
print(Uni_df['THE'].isnull().sum().sort_values(ascending = False))
print("================================")
print(Uni_df['ARWU'].isnull().sum().sort_values(ascending = False))
print("================================")
print(Uni_df['CWUR'].isnull().sum().sort_values(ascending = False))

sdg-score-multi__number 7    1152
sdg-score-multi__value 7     1152
sdg-score-multi__value 8     1108
sdg-score-multi__number 8    1108
sdg-score-multi__value 6     1095
sdg-score-multi__number 6    1093
sdg-score-multi__value 5     1034
sdg-score-multi__number 5    1026
sdg-score-multi__value 3      786
sdg-score-multi__number 3     779
sdg-score-multi__value 2      766
sdg-score-multi__number 2     765
sdg-score-multi__number       724
sdg-score-multi__value        724
Location                       91
sdg-score-multi__value 4        8
Total Score                     0
University Name                 0
Rank                            0
dtype: int64
================================
Rank               0
University Name    0
National Rank      0
Total Score        0
dtype: int64
================================
Rank                  0
University Name       0
Location              0
National Rank         0
Educational Rank      0
Employability Rank    0
Faculty Rank          0
Research Rank         0
Total Score           0
dtype: int64

In [ ]:
#check the Location nulls
Uni_df['THE'][Uni_df['THE']['Location'].isnull()]

In [99]:
Uni_df['THE'][Uni_df['THE']['Location'].isnull()].isnull().sum()

Rank                          0
University Name               0
Location                     91
sdg-score-multi__number       8
sdg-score-multi__value        8
sdg-score-multi__number 2     6
sdg-score-multi__value 2      7
sdg-score-multi__number 3    12
sdg-score-multi__value 3     19
sdg-score-multi__value 4      8
Total Score                   0
sdg-score-multi__number 5    67
sdg-score-multi__value 5     75
sdg-score-multi__number 6    89
sdg-score-multi__value 6     91
sdg-score-multi__number 7    91
sdg-score-multi__value 7     91
sdg-score-multi__number 8    91
sdg-score-multi__value 8     91
dtype: int64

In [ ]:
Uni_df['THE']['Location'].fillna('Unknown', inplace=True)

In [101]:
# Uni_df['THE'][Uni_df['THE']['Location'].isnull()]

Empty DataFrame
Columns: [Rank, University Name, Location, sdg-score-multi__number, sdg-score-multi__value, sdg-score-multi__number 2, sdg-score-multi__value 2, sdg-score-multi__number 3, sdg-score-multi__value 3, sdg-score-multi__value 4, Total Score, sdg-score-multi__number 5, sdg-score-multi__value 5, sdg-score-multi__number 6, sdg-score-multi__value 6, sdg-score-multi__number 7, sdg-score-multi__value 7, sdg-score-multi__number 8, sdg-score-multi__value 8]
Index: []

In [ ]:
# Uni_df['THE'].head(14)

In [ ]:
# Uni_df['THE'][Uni_df['THE']['Rank'].isnull()]

In [105]:
# Uni_df['THE']['Rank'] = Uni_df['THE']['Rank'].map(lambda x :x)

In [ ]:
# Uni_df['THE'][Uni_df['THE']['Rank'].isnull()]

In [107]:
#check for duplicates in the rank for CWUR
Uni_df['CWUR']['Rank'].duplicated().sum()

0

In [108]:
Uni_df['CWUR'].head(1)

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score
0,1Top 0.1%,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0

In [109]:
Uni_df['CWUR'] ['Ratio'] = Uni_df['CWUR']['Rank'].map(lambda x : x.split('Top')[1])
Uni_df['CWUR'] ['Rank'] = Uni_df['CWUR']['Rank'].map(lambda x : int(x.split('Top')[0]))

In [110]:
Uni_df['CWUR'].head(1)

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0,0.1%

In [111]:
Uni_df['CWUR'].dtypes

Rank                    int64
University Name        object
Location               object
National Rank           int64
Educational Rank       object
Employability Rank     object
Faculty Rank           object
Research Rank          object
Total Score           float64
Ratio                  object
dtype: object

In [112]:
Uni_df['CWUR'][(Uni_df['CWUR']['Educational Rank']=='-')]

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
35,36,"University of California, San Francisco",USA,23,-,1554,15,27,86.0,0.2%
54,55,University of Chinese Academy of Sciences,China,3,-,1304,-,6,84.3,0.3%
68,69,"Texas A&M University, College Station",USA,39,-,129,72,85,83.4,0.4%
73,74,Shanghai Jiao Tong University,China,4,-,140,-,29,83.1,0.4%
84,85,Zhejiang University,China,5,-,351,-,32,82.5,0.5%
...,...,...,...,...,...,...,...,...,...,...
1995,1996,Chongqing Jiaotong University,China,314,-,-,-,1917,66.0,9.8%
1996,1997,University of Arkansas at Little Rock,USA,332,-,1322,-,1920,66.0,9.8%
1997,1998,Van Yüzüncü Yıl University,Turkey,54,-,-,-,1919,66.0,9.8%
1998,1999,Bharathidasan University,India,64,-,-,-,1922,66.0,9.8%
1999,2000,Gebze Technical University,Turkey,55,-,-,-,1923,66.0,9.8%

In [113]:
Uni_df['CWUR']['Educational Rank'] = Uni_df['CWUR']['Educational Rank'].map(lambda x : 0 if x =='-' else int(x))

In [114]:
Uni_df['CWUR'].dtypes

Rank                    int64
University Name        object
Location               object
National Rank           int64
Educational Rank        int64
Employability Rank     object
Faculty Rank           object
Research Rank          object
Total Score           float64
Ratio                  object
dtype: object

In [115]:
Uni_df['CWUR'][(Uni_df['CWUR']['Educational Rank']=='-')]

Empty DataFrame
Columns: [Rank, University Name, Location, National Rank, Educational Rank, Employability Rank, Faculty Rank, Research Rank, Total Score, Ratio]
Index: []

In [116]:
Uni_df['CWUR'].head()

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0,0.1%
1,2,Massachusetts Institute of Technology\n Educa...,USA,2,4,12,3,9,96.7,0.1%
2,3,Stanford University\n Education: A+; Employab...,USA,3,11,4,2,2,95.2,0.1%
3,4,University of Cambridge\n Education: A+; Empl...,United Kingdom,1,3,25,5,11,94.1,0.1%
4,5,University of Oxford\n Education: A+; Employa...,United Kingdom,2,7,27,9,4,93.3,0.1%

In [121]:
Uni_df['CWUR']['Employability Rank'] = Uni_df['CWUR']['Employability Rank'].map(lambda x : 0 if x =='-' else int(x))
Uni_df['CWUR']['Faculty Rank'] = Uni_df['CWUR']['Faculty Rank'].map(lambda x : 0 if x =='-' else int(x))
Uni_df['CWUR']['Research Rank'] = Uni_df['CWUR']['Research Rank'].map(lambda x : 0 if x =='-' else int(x))

In [122]:
display(Uni_df['CWUR'][(Uni_df['CWUR']['Employability Rank']=='-')])
display(Uni_df['CWUR'][(Uni_df['CWUR']['Faculty Rank']=='-')])
display(Uni_df['CWUR'][(Uni_df['CWUR']['Research Rank']=='-')])

Empty DataFrame
Columns: [Rank, University Name, Location, National Rank, Educational Rank, Employability Rank, Faculty Rank, Research Rank, Total Score, Ratio]
Index: []

Empty DataFrame
Columns: [Rank, University Name, Location, National Rank, Educational Rank, Employability Rank, Faculty Rank, Research Rank, Total Score, Ratio]
Index: []

Empty DataFrame
Columns: [Rank, University Name, Location, National Rank, Educational Rank, Employability Rank, Faculty Rank, Research Rank, Total Score, Ratio]
Index: []

In [123]:
Uni_df['CWUR'].head()

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0,0.1%
1,2,Massachusetts Institute of Technology\n Educa...,USA,2,4,12,3,9,96.7,0.1%
2,3,Stanford University\n Education: A+; Employab...,USA,3,11,4,2,2,95.2,0.1%
3,4,University of Cambridge\n Education: A+; Empl...,United Kingdom,1,3,25,5,11,94.1,0.1%
4,5,University of Oxford\n Education: A+; Employa...,United Kingdom,2,7,27,9,4,93.3,0.1%

In [126]:
Uni_df['CWUR']['University Name'] = Uni_df['CWUR']['University Name'].map(lambda x : x.split('\n')[0])

In [127]:
Uni_df['CWUR'].head()

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University,USA,1,1,1,1,1,100.0,0.1%
1,2,Massachusetts Institute of Technology,USA,2,4,12,3,9,96.7,0.1%
2,3,Stanford University,USA,3,11,4,2,2,95.2,0.1%
3,4,University of Cambridge,United Kingdom,1,3,25,5,11,94.1,0.1%
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93.3,0.1%

In [165]:
Uni_df['CWUR'].dtypes

Rank                    int64
University Name        object
Location               object
National Rank           int64
Educational Rank        int64
Employability Rank      int64
Faculty Rank            int64
Research Rank           int64
Total Score           float64
Ratio                 float64
dtype: object

In [130]:
Uni_df['CWUR']['Ratio'] = Uni_df['CWUR']['Ratio'].map(lambda x : float(x.split('%')[0]))

In [131]:
Uni_df['CWUR'].head()

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University,USA,1,1,1,1,1,100.0,0.1
1,2,Massachusetts Institute of Technology,USA,2,4,12,3,9,96.7,0.1
2,3,Stanford University,USA,3,11,4,2,2,95.2,0.1
3,4,University of Cambridge,United Kingdom,1,3,25,5,11,94.1,0.1
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93.3,0.1

In [117]:
[(Uni_df['CWUR']['Educational Rank'] == '-').sum()]

[0]

In [118]:
Uni_df['CWUR'].shape

(2000, 10)

In [133]:
Uni_df['ARWU'].dtypes

Rank                object
University Name     object
National Rank       object
Total Score        float64
dtype: object

In [134]:
Uni_df['ARWU'].head()

  Rank                              University Name National Rank  Total Score
0    1                           Harvard University             1        100.0
1    2                          Stanford University             2         76.8
2    3  Massachusetts Institute of Technology (MIT)             3         70.1
3    4                      University of Cambridge             1         69.6
4    5           University of California, Berkeley             4         65.3

In [147]:
Uni_df['ARWU'][Uni_df['ARWU']['National Rank'] == '2-3']

Empty DataFrame
Columns: [Rank, University Name, National Rank, Total Score]
Index: []

In [146]:
Uni_df['ARWU']['National Rank'] = Uni_df['ARWU']['National Rank'].map(lambda x : int(x.split('-')[0]) if '-' in x else int(x))

In [150]:
Uni_df['ARWU'].dtypes

Rank                object
University Name     object
National Rank        int64
Total Score        float64
dtype: object

In [156]:
Uni_df['ARWU']['Total Score'][100:] = 0

C:\Users\Sulaiman\AppData\Local\Temp\ipykernel_36016\495153695.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Uni_df['ARWU']['Total Score'][100:] = 0
C:\Users\Sulaiman\AppData\Local\Temp\ipykernel_36016\495153695.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Uni_df['ARWU']['Total Score'][100:] = 0

In [164]:
#Change the rank type, and when you find a range take the lowest number
Uni_df['ARWU']['Rank'] = Uni_df['ARWU']['Rank'].map(lambda x : int(x.split('-')[0]) if '-' in x else int(x))

In [119]:
#extra question what are the top 1 universties in each region or country
Uni_df['CWUR'][Uni_df['CWUR']['National Rank'] == 1]

,Rank,University Name,Location,National Rank,Educational Rank,Employability Rank,Faculty Rank,Research Rank,Total Score,Ratio
0,1,Harvard University\n CWUR Rating System: Ed...,USA,1,1,1,1,1,100.0,0.1%
3,4,University of Cambridge\n Education: A+; Empl...,United Kingdom,1,3,25,5,11,94.1,0.1%
12,13,University of Tokyo,Japan,1,37,6,113,30,89.8,0.1%
20,21,PSL University,France,1,17,31,111,91,88.0,0.2%
22,23,University of Toronto,Canada,1,233,163,23,3,87.7,0.2%
...,...,...,...,...,...,...,...,...,...,...
1823,1824,Tribhuvan University,Nepal,1,0,-,-,1751,66.6,8.9%
1919,1920,Muhimbili University of Health and Allied Scie...,Tanzania,1,0,-,-,1843,66.2,9.4%
1929,1930,University of Science and Technology Houari Bo...,Algeria,1,0,-,-,1853,66.2,9.5%
1945,1946,An-Najah National University,Palestine,1,0,-,-,1866,66.2,9.5%
1989,1990,Ss. Cyril and Methodius University in Skopje,North Macedonia,1,0,-,-,1912,66.0,9.7%

In [ ]:
#extra question what are the top universties in suadi arabia
Uni_df['CWUR'][Uni_df['CWUR']['Location '] == 'Saudi Arabia']

In [ ]:
#most compattive rank